PinkFluffyUnic0rn/stm32flight/main.c
/**
* @file main.c
* @brief Main file with entry point
*/

#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <ctype.h>

#include "mcudef.h"

#include "periphconf.h"
#include "settings.h"
#include "dsp.h"
#include "log.h"
#include "crc.h"
#include "runvals.h"
#include "timev.h"
#include "command.h"
#include "config.h"
#include "util.h"

#include "device.h"
#include "icm42688.h"
#include "dps368.h"
#include "esp8266.h"
#include "qmc5883l.h"
#include "crsf.h"
#include "w25.h"
#include "m10.h"
#include "uartconf.h"
#include "irc.h"
#include "msp.h"
#include "dshot.h"

/**
* @brief External interrupt callback. It calls interrupt handlers
	from drivers for devices that use external interrupts.
* @param pin number of pin triggered the callback
* @return none
*/
void HAL_GPIO_EXTI_Callback(uint16_t pin)
{
	if (DEVITENABLED(Dev[DEV_RF].status)) {
		Dev[DEV_RF].interrupt(Dev[DEV_RF].priv, &pin);
	}
}

/**
* @brief UART receive callback. It calls interrupt handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback
* @return none
*/
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(Dev[DEV_GNSS].status))
		Dev[DEV_GNSS].interrupt(Dev[DEV_GNSS].priv, huart);

	if (DEVITENABLED(Dev[DEV_CRSF].status))
		Dev[DEV_CRSF].interrupt(Dev[DEV_CRSF].priv, huart);

	if (DEVITENABLED(Dev[DEV_VTX].status))
		Dev[DEV_VTX].interrupt(Dev[DEV_VTX].priv, huart);

	if (DEVITENABLED(Dev[DEV_UART].status))
		Dev[DEV_UART].interrupt(Dev[DEV_UART].priv, huart);
}

/**
* @brief SPI transmit callback. It calls interrupt handlers
	from drivers for devices working through SPI.
* @param hspi context for SPI triggered that callback
* @return none
*/
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
	if (DEVITENABLED(Flashdev.status))
		Dev[DEV_IMU].interrupt(Flashdev.priv, hspi);
}

/**
* @brief UART error callback. Calls UART error handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback.
* @return none
*/
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(Dev[DEV_CRSF].status))
		Dev[DEV_CRSF].error(Dev[DEV_CRSF].priv, huart);

	if (DEVITENABLED(Dev[DEV_VTX].status))
		Dev[DEV_VTX].error(Dev[DEV_VTX].priv, huart);
}

/**
* @brief Non-maskable interrupt handler.
* @return none
*/
void NMI_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	while (1) {}
}

/**
* @brief Hard-fault interrupt handler.
* @return none
*/
void HardFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);
	
	while (1) {}
}

/**
* @brief Memory management error interrupt handler.
* @return none
*/
void MemManage_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	while (1) {}
}

/**
* @brief Bus fault error interrupt handler.
* @return none
*/
void BusFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);
	
	while (1) {}
}

/**
* @brief Usage fault error interrupt handler.
* @return none
*/
void UsageFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	while (1) {}
}

/**
* @brief HAL error handler.
* @return none
*/
void error_handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	__disable_irq();
	while (1) {}
}

/**
* @brief Get ADC sampled value.
* @param hadc ADC handle
* @param buf write buffer for DMA
* @return samlped value
*/
float adcvalue(ADC_HandleTypeDef *hadc, volatile uint16_t *buf)
{
	uint32_t v;
	int t;

	t = 0;
	while ((HAL_ADC_GetState(hadc) & HAL_ADC_STATE_REG_BUSY) != 0
			&& t < 100000) {
		udelay(10);
		t += 10;
	}

	v = *buf;

	HAL_ADC_Start_DMA(hadc, (uint32_t *) buf, 1);

	return v;
}

/**
* @brief Get battery voltage from ADC.
* @return battery voltage
*/
float batteryvoltage()
{
	ADC_HandleTypeDef *hadc;
	static volatile uint16_t buf = 0;

	hadc = pconf_batteryhadc;

	return (adcvalue(hadc, &buf)
		/ (float) 0xfff * BAT_SCALE * St.adj.batsc);
}

/**
* @brief Get ESC current from ADC.
* @return battery current in amperes
*/
float esccurrent()
{
	ADC_HandleTypeDef *hadc;
	static volatile uint16_t buf = 0;
	
	hadc = pconf_currenthadc;

	return (adcvalue(hadc, &buf)
		/ (float) 0xfff * St.adj.current.scale
		+ St.adj.current.offset);

}

/**
* @brief Calculate tilt compensated heading direction
	using magnetometer readings, roll value and pitch value.
* @param r roll value
* @param p pitch value
* @param x magnetometer's X axis value
* @param y magnetometer's Y axis value
* @param z magnetometer's Z axis value
* @return tilt compensated heading
*/
float qmc_heading(float r, float p, float x, float y, float z)
{
	x = x * cosf(p) + y * sinf(r) * sinf(p)
		- z * cosf(r) * sinf(p);
	y = y * cosf(r) + z * sinf(r);

	return circf(atan2f(y, x) + St.adj.magdecl);
}

int imuupdate(int ms)
{
	// get accelerometer and gyroscope readings
	Dev[DEV_IMU].read(Dev[DEV_IMU].priv, &Imudata,
		sizeof(struct icm_data));

	return 0;
}

/**
* @brief Stabilization loop. Callback for TEV_PID periodic event.
	It is the place where is almost all work happening.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int stabilize(int ms)
{
	static float prevalt = 0.0;
	float ltm, lbm, rbm, rtm;
	float roll, pitch, yaw;
	float rollcor, pitchcor, yawcor, thrustcor;
	float vx, vy, vz;
	float gy, gx, gz;
	float ay, ax, az;
	float va;
	float ht;
	float dt;
	float alt;
	float tiltcoef;
	float altcor;

	// debug pin switching
	HAL_GPIO_WritePin(debuggpio, debugpin,
		!(HAL_GPIO_ReadPin(debuggpio, debugpin)));

	// emergency disarm happened
	if (Emergencydisarm) {
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);
		En = 0.0;
	}

	// get time passed from last invocation of this calback function
	dt = ms / (float) TICKSPERSEC;

	// divide-by-zero protection
	dt = (dt < 0.000001) ? 0.000001 : dt;

