PinkFluffyUnic0rn/stm32flight/main.c
	// update battery voltage
	writelog(LOG_BAT, dsp_getlpf(Lpf + LPF_BAT));

	// toggle arming indication led
	HAL_GPIO_WritePin(armgpio, armpin,
		(En > 0.5) ? GPIO_PIN_SET : GPIO_PIN_RESET);

	// apply accelerometer offsets
	Imudata.afx += (Imudata.ft - 25.0) * St.adj.acctsc.x;
	Imudata.afy += (Imudata.ft - 25.0) * St.adj.acctsc.y;
	Imudata.afz += (Imudata.ft - 25.0) * St.adj.acctsc.z;
	Imudata.afx -= St.adj.acc0.x;
	Imudata.afy -= St.adj.acc0.y;
	Imudata.afz -= St.adj.acc0.z;

	// apply gyroscope offsets
	Imudata.gfx -= St.adj.gyro0.x;
	Imudata.gfy -= St.adj.gyro0.y;
	Imudata.gfz -= St.adj.gyro0.z;

	// write accelerometer and gyroscope values into log
	writelog(LOG_ACC_X, Imudata.afx);
	writelog(LOG_ACC_Y, Imudata.afy);
	writelog(LOG_ACC_Z, Imudata.afz);
	writelog(LOG_GYRO_X, Imudata.gfx);
	writelog(LOG_GYRO_Y, Imudata.gfy);
	writelog(LOG_GYRO_Z, Imudata.gfz);

	// update accelerometer temperature
	dsp_updatelpf(Lpf + LPF_IMUTEMP, Imudata.ft);

	// apply accelerometer offsets
	ax = dsp_updatelpf(Lpf + LPF_ACCX, Imudata.afx);
	ay = dsp_updatelpf(Lpf + LPF_ACCY, Imudata.afy);
	az = dsp_updatelpf(Lpf + LPF_ACCZ, Imudata.afz);

	// update vertical acceleration low-pass filter
	dsp_updatelpf(Lpf + LPF_THR, Imudata.afz);

	// convert gyroscope values into radians
	gx = deg2rad(dsp_updatelpf(Lpf + LPF_GYROX, Imudata.gfx));
	gy = deg2rad(dsp_updatelpf(Lpf + LPF_GYROY, Imudata.gfy));
	gz = deg2rad(dsp_updatelpf(Lpf + LPF_GYROZ, Imudata.gfz));

	// update complimenraty filter for roll axis and get next roll
	// value. First signal (value) is signal to be integrated: it's
	// the speed of the rotation around Y axis. Second signal is
	// signal to be low-pass filtered: it's the tilt value that is
	// calculated from acceleromer readings through some
	// trigonometry.
	roll = dsp_updatelpf(Lpf + LPF_ROLL,
		dsp_updatecompl(Cmpl + CMPL_ROLL, gy * dt,
			atan2f(-ax, az) - St.adj.att0.roll));

	// same as for roll but for different axes
	pitch = dsp_updatelpf(Lpf + LPF_PITCH,
		dsp_updatecompl(Cmpl + CMPL_PITCH, gx * dt,
			atan2f(ay, sqrt(ax * ax + az * az))) 
				- St.adj.att0.pitch);

	// update complimenraty filter for yaw axis and get next yaw
	// value. First signal is the speed of the rotation around Z
	// axis. Second signal is the heading value that is
	// calculated from magnetometer readings.
	yaw = dsp_updatelpf(Lpf + LPF_YAW,
		circf(dsp_updatecirccompl(Cmpl + CMPL_YAW, -gz * dt,
		qmc_heading(roll, -pitch,
			Qmcdata.fx, Qmcdata.fy, Qmcdata.fz)) 
			- St.adj.att0.yaw));

	// calculate gravity direction vector in IMU coordination system
	// using pitch and roll values;
	vx = -sin(roll);
	vy = sin(pitch) * cos(roll);
	vz = cos(pitch) * cos(roll);

	// update vertical acceleration using acceleration
	// vector to gravity vector projection
	va = (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz);

	dsp_updatelpf(Lpf + LPF_VAU, va);
	dsp_updatelpf(Lpf + LPF_VAPT1, va);
	dsp_updatelpf(Lpf + LPF_VAAVG, va);

	// write vertical acceleration into log	
	writelog(LOG_VACCEL, dsp_getlpf(Lpf + LPF_VAU));

	// calculate forward direction vector in IMU
	// coordination system using pitch and roll values;
	vx = 0;
	vy = cos(pitch);
	vz = -sin(pitch);

	// update forward acceleration using acceleration
	// vector to gravity vector projection
	dsp_updatelpf(Lpf + LPF_FA, (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz));

	// write forward acceleration into log	
	writelog(LOG_FACCEL, dsp_getlpf(Lpf + LPF_FA));

	// calculate sideward direction vector in IMU
	// coordination system using pitch and roll values;
	vx = cos(roll);
	vy = sin(pitch) * sin(roll);
	vz = sin(roll) * cos(pitch);

	// update sideward acceleration using acceleration
	// vector to gravity vector projection
	dsp_updatelpf(Lpf + LPF_SA, (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz));
	
	// write sideward acceleration into log	
	writelog(LOG_SACCEL, dsp_getlpf(Lpf + LPF_SA));

	// get last barometric altitude
	alt = dsp_getlpf(Lpf + LPF_ALT);

	// calculate altitude thrust compensation
	altcor = St.adj.althold.alttha * dsp_getlpf(Lpf + LPF_AVGTHRA)
		+ St.adj.althold.altthb;
	altcor = (altcor < 0.0) ? 0.0 : altcor;

	// compensate thrust for altitude
	alt -= altcor;	

	// if GNSS is locked, use speed to compensate dynamic pressure
	if (Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)) {
		altcor = St.adj.althold.altthc
			* Gnss.speed * Gnss.speed;
		alt -= altcor;
	}

	// calculate climb rate from vertical acceleration and
	// barometric altitude defference using complimentary filter
	dsp_updatecompl(Cmpl + CMPL_CLIMBRATE,
		9.80665 * (dsp_getlpf(Lpf + LPF_VAU) + Goffset - 1.0) * dt,
			(dsp_getcompl(Cmpl + CMPL_ALT) - prevalt) / dt);
	
	// calculate presice altitiude from climb rate and
	// barometric altitude using complimentary filter
	dsp_updatecompl(Cmpl + CMPL_ALT,
		dsp_getcompl(Cmpl + CMPL_CLIMBRATE) * dt, alt);

	// store calculated alt for next calculation
	prevalt = dsp_getcompl(Cmpl + CMPL_ALT);

	// write climbrate and altitude values into log
	writelog(LOG_CLIMBRATE, dsp_getcompl(Cmpl + CMPL_CLIMBRATE));
	writelog(LOG_ALT, dsp_getcompl(Cmpl + CMPL_ALT));

	// get tilt compensation coefficient
	tiltcoef = cosf(-pitch) * cosf(-roll);

	// get pitch corrected value of the hover throttle
	ht = St.adj.althold.hoverthrottle / tiltcoef;

	// if vertical acceleration is negative, most likely
	// quadcopter is upside down, perform emergency disarm
	if (dsp_getlpf(Lpf + LPF_THR) < -0.5) {
		Emergencydisarm = 1;
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);
		En = 0.0;
	}

	// write roll, pitch and yaw values into log
	writelog(LOG_ROLL, roll);
	writelog(LOG_PITCH, pitch);
	writelog(LOG_YAW, yaw);

	if (Speedpid) {
		// if in single PID loop mode for tilt
		// (called accro mode), use only rotation speed values
		// from the gyroscope. Update speed PID controllers for
		// roll and pitch and get next correction values.
		rollcor = dsp_pidbl(Pid + PID_ROLLS, Rolltarget, gy);
		pitchcor = dsp_pidbl(Pid + PID_PITCHS, Pitchtarget, gx);
	}
	else {
		// if in double loop mode for tilt (most commonly used
		// mode), first update roll and pitch POSITION PID
		// controllers using currect roll and values and targets
		// got from ERLS and get next correction values.
		rollcor = dsp_pidbl(Pid + PID_ROLLP, Rolltarget, roll);
		pitchcor = dsp_pidbl(Pid + PID_PITCHP, Pitchtarget, pitch);

		// then use this values to update roll and pitch speed
		// PID controllers and get next SPEED correction values.
		rollcor = dsp_pidbl(Pid + PID_ROLLS, rollcor, gy);
		pitchcor = dsp_pidbl(Pid + PID_PITCHS, pitchcor, gx);
	}

	if (Yawspeedpid) {
		// if single PID loop mode for yaw is used just use
		// rotation speed values around axis Z to upadte yaw PID
		// controller and get next yaw correciton value
		yawcor = dsp_pidbl(Pid + PID_YAWS, Yawtarget, -gz);
	}
	else {
		// if in double loop mode for yaw, first use yaw value
		// calcualted using magnetometer and yaw target got from
		// ELRS remote to update yaw POSITION PID controller and
		// get it's next correciton value.
		yawcor = dsp_pidbl(Pid + PID_YAWP, Yawtarget, yaw);

		// then use this value to update yaw speed PID
		// controller and get next yaw SPEED correction value
		yawcor = dsp_pidbl(Pid + PID_YAWS, yawcor, -gz);
	}

