PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

/**
* @brief Update log frame. If buffer isn't full, just move
	buffer pointer, otherwise save buffer content into flash and
	set buffer pointer to 0.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int logupdate(int ms)
{
	updatelog();

	return 0;
}

/**
* @brief Send telemetry through ELRS.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int telesend(int ms)
{
	const char *attmodestr[] = {"ac", "st", "sp", "ps"};
	const char *yawmodestr[] = {"sp", "cs"};
	const char *altmodestr[] = {"tr", "cl", "al"};
	const char *am;

	Tele.bat = dsp_getlpf(Lpf + LPF_BAT);
	Tele.curr = dsp_getlpf(Lpf + LPF_CUR);

	// Determine battery series cells count using it voltage
	// and calculate it's remaining charge in percents
	if (Tele.bat < 6.0)
		Tele.batrem = (Tele.bat - 3.5) / 0.7;
	else if (Tele.bat < 9.0)
		Tele.batrem = (Tele.bat - 7.0) / 1.4;
	else if (Tele.bat < 13.5)
		Tele.batrem = (Tele.bat - 10.5) / 2.1;
	else if (Tele.bat < 18.0)
		Tele.batrem = (Tele.bat - 14) / 2.8;
	else
		Tele.batrem = (Tele.bat - 21) / 3.5;

	Tele.batrem = trimf(100.0 * Tele.batrem, 0.0, 100.0);

	Tele.lat = Gnss.declat;
	Tele.lon = Gnss.declon;
	Tele.speed = Gnss.speed;
	Tele.course = Gnss.course;
	Tele.alt = Gnss.altitude;
	Tele.sats = Gnss.satellites;
	Tele.balt = dsp_getcompl(Cmpl + CMPL_ALT) - Alt0;
	Tele.vspeed = dsp_getcompl(Cmpl + CMPL_CLIMBRATE);
	Tele.roll = dsp_getlpf(Lpf + LPF_ROLL);
	Tele.pitch = dsp_getlpf(Lpf + LPF_PITCH);
	Tele.yaw = dsp_getlpf(Lpf + LPF_YAW);

	// fill flight mode string with arm state and
	// combination of stabilization modes codes
	if (Altmode == ALTMODE_ACCEL)
		am = altmodestr[0];
	else if (Altmode == ALTMODE_SPEED)
		am = altmodestr[1];
	else if (Altmode == ALTMODE_POS)
		am = altmodestr[2];
	else
		am = "---";

	Tele.mode[0] = En > 0.5 ? 'a' : 'n';
	Tele.mode[1] = '|';
	memcpy(Tele.mode + 2, attmodestr[Speedpid ? 0 : 1], 2);
	Tele.mode[4] = '|';
	memcpy(Tele.mode + 5, yawmodestr[Yawspeedpid ? 0 : 1], 2);
	Tele.mode[7] = '|';
	memcpy(Tele.mode + 8, am, 2);

	// in case of emergency disarming
	// set flight mode to "stopped"
	if (Emergencydisarm)
		strcpy((char *) Tele.mode, "stopped");

	// perform telemetry write step	on CRSF eLRS
	// reciever to send it back to remote
	Dev[DEV_CRSF].write(Dev[DEV_CRSF].priv, &Tele,
		sizeof(struct crsf_tele));

	Osd.armed = (En > 0.5) ? 1 : 0;
	Osd.attmode = Speedpid ? MSP_ATTMODE_GYRO : MSP_ATTMODE_ACC;
	Osd.yawmode = Yawspeedpid ? MSP_YAWMODE_GYRO : MSP_YAWMODE_MAG;

	if (Altmode == ALTMODE_ACCEL)
		Osd.altmode = MSP_ALTMODE_ACCEL;
	else if (Altmode == ALTMODE_SPEED)
		Osd.altmode = MSP_ALTMODE_SPEED;
	else if (Altmode == ALTMODE_POS)
		Osd.altmode = MSP_ALTMODE_POS;

	Osd.bat = Tele.bat;
	Osd.curr = Tele.curr;
	Osd.batrem = Tele.batrem;
	Osd.lat = Tele.lat;
	Osd.lon = Tele.lon;
	Osd.speed = Tele.speed;
	Osd.course = Tele.course;
	Osd.alt = Tele.balt;
	Osd.sats = Tele.sats;
	Osd.vspeed = Tele.vspeed;
	Osd.temp = dsp_getlpf(Lpf + LPF_BARTEMP);
	Osd.roll = Tele.roll;
	Osd.pitch = Tele.pitch;
	Osd.yaw = Tele.yaw;

	// perform OSD draw step on VTX device
	Dev[DEV_VTX].write(Dev[DEV_VTX].priv, &Osd,
		sizeof(struct msp_osd));

	return 0;
}

/**
* @brief Update battery voltage and current.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int powercheck(int ms)
{
	dsp_updatelpf(Lpf + LPF_BAT, batteryvoltage());
	dsp_updatelpf(Lpf + LPF_CUR, esccurrent());

	return 0;
}

/**
* @brief Move to next point in autopilot track.
* @return always 0
*/
int autopilotstep()
{
	Autopilottimer = 0;
	++Curpoint;

	return 0;
}

/**
* @brief Update control values when moving in autopilot mode.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int autopilotupdate(int ms)
{
	struct trackpoint *nextpoint;
	float dt;

	dt = ms / (float) TICKSPERSEC;
	
	// divide-by-zero protection
	dt = (dt < 0.000001) ? 0.000001 : dt;

	if (!Autopilot || Pointscount == 0 || Curpoint < 0
			|| Curpoint >= Pointscount) {
		return 0;
	}

	nextpoint = Points + Curpoint + 1;
	if (nextpoint->type == AUTOPILOT_START)
		Autopilottimer = 0.0;
	else if (nextpoint->type == AUTOPILOT_TAKEOFF) {
		Thrust = Autopilottimer * nextpoint->takeoff.alt
			/ nextpoint->takeoff.t;
		
		Autopilottimer += dt;

		if (Autopilottimer > nextpoint->takeoff.t)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_HOVER) {
		Thrust = nextpoint->hover.alt;
		
		Yawtarget = atan2f(nextpoint->hover.x,
			nextpoint->hover.y);
		
		Autopilottimer += dt;

		if (Autopilottimer > nextpoint->hover.t)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_LANDING) {
		if (dsp_getcompl(Cmpl + CMPL_ALT) - Alt0 > 5.0)
			Thrust -= dt;
		else if (dsp_getcompl(Cmpl + CMPL_ALT) - Alt0 > 5.0)
			Thrust -= dt * 0.5;
		else if (dsp_getcompl(Cmpl + CMPL_ALT) - Alt0 > 2.0)
			Thrust -= dt * 0.25;
		else
			Thrust -= dt * 0.125;
		
		if (dsp_getcompl(Cmpl + CMPL_ALT) - Alt0 <= 0.1)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_STOP) {
		Thrust = -1.0;
	}
	else if (nextpoint->type == AUTOPILOT_FORWARD) {
/*
		float dx, dy;
	
		Pitchtarget = M_PI / 12.0;
		
		Yawtarget = atan2f(nextpoint->forward.x,
			nextpoint->forward.y);

		dx = nextpoint->forward.x - Points[Curpoint].forward.x;
		dy = nextpoint->forward.y - Points[Curpoint].forward.y;

		if (forwardpath > sqrtf(dx * dx + dy * dy))
*/
		autopilotstep();
	}

	return 0;
}

/**
* @brief Set control values using CRSF packet.
* @param cd -- CRSF packet
* @param ms -- microsecond passed from last CRSF packet
* @return always 0
*/
int crsfcmd(const struct crsf_data *cd, int ms)
{
	static float slottimeout = ELRS_PUSHTIMEOUT;
	float dt;
	int slot;

	// write first 8 channels values into log	
	writelog(LOG_CRSFCH0, cd->chf[ERLS_CH_ROLL]);
	writelog(LOG_CRSFCH1, cd->chf[ERLS_CH_PITCH]);
	writelog(LOG_CRSFCH2, cd->chf[ERLS_CH_THRUST]);
	writelog(LOG_CRSFCH3, cd->chf[ERLS_CH_YAW]);
	writelog(LOG_CRSFCH4, cd->chf[ERLS_CH_YAWMODE]);
	writelog(LOG_CRSFCH5, cd->chf[ERLS_CH_ATTMODE]);
	writelog(LOG_CRSFCH6, cd->chf[ERLS_CH_THRMODE]);
	writelog(LOG_CRSFCH7, cd->chf[ERLS_CH_ONOFF]);

	// ONOFF channel on remote is used to turn on/off
	// erls control. If this channel has low state, all remote
	// commands will be ignored, but packet still continue to
	// comming
	Elrs = (cd->chf[ERLS_CH_ONOFF] > 0.5) ? 1 : 0;

	// update ERLS timeout as we got packet
	Elrstimeout = ELRS_TIMEOUT;

	if (!Elrs) {
		En = 0.0;
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);

