PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim)
{
	static int elrsus = 0;

	char cmd[CMDSIZE];
	struct crsf_data cd;
	struct m10_data nd;
	int c, i;

	if (htim->Instance != pconf_schedhtim->Instance)
		return;

	if (!Init)
		return;

	c = TICKSPERSEC / PID_FREQ;

	// update periodic events timers
	for (i = 0; i < TEV_COUNT; ++i)
		updatetimev(Evs + i, c);

	// update ELRS timer
	elrsus += c;

	// check all periodic events context's and run callbacks
	// if enough time passed. Reset their timers after.
	for (i = 0; i < TEV_COUNT; ++i) {
		if (checktimev(Evs + i))
			runtimev(Evs + i);
	}

	// poll for configuration and telemetry commands
	// from debug wifi connection
	if (Dev[DEV_RF].read(Dev[DEV_RF].priv, &cmd,
			CMDSIZE) >= 0) {
		runcommand(Dev + DEV_RF, cmd);
	}

	// poll for configuration and telemtry commands
	// from debug uart connection
	if (Dev[DEV_UART].read(Dev[DEV_UART].priv, &cmd,
			UART_CMDSIZE) >= 0) {
		runcommand(Dev + DEV_UART, cmd);
	}

	// read the ELRS remote's packet
	if (Dev[DEV_CRSF].read(Dev[DEV_CRSF].priv, &cd,
			sizeof(struct crsf_data)) >= 0) {
		crsfcmd(&cd, elrsus);
		elrsus = 0;
	}

	// check the M10 messages
	if (Dev[DEV_GNSS].read(Dev[DEV_GNSS].priv, &nd,
			sizeof(struct m10_data)) >= 0) {
		m10msg(&nd);
	}
}

/**
* @brief Entry point
* @return always 0
*/
int main(void)
{
	// init periphery
	pconf_init(error_handler);
	
	// reading settings from memory current
	// memory slot, which is 0 at start
	readsettings(Curslot);

	// set IRC VTX power and frequency using values from settings
	updatevtx();

	// initialize stabilization routine
	setstabilize(1);

	// initilize periodic events
	inittimev(Evs + TEV_IMU, 0, PID_FREQ, imuupdate);
	inittimev(Evs + TEV_LOG, 0, St.log.freq,  logupdate);
	inittimev(Evs + TEV_PID, 0, PID_FREQ, stabilize);
	inittimev(Evs + TEV_CHECK,
		1 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		CHECK_FREQ, checkconnection);
	inittimev(Evs + TEV_BARO,
		2 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		DPS_FREQ, baroupdate);
	inittimev(Evs + TEV_MAG,
		3 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		QMC_FREQ, magupdate);
	inittimev(Evs + TEV_TELE,
		5 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		TELE_FREQ, telesend);
	inittimev(Evs + TEV_POWER,
		6 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		POWER_FREQ, powercheck);
	inittimev(Evs + TEV_AUTOPILOT,
		7 * PID_FREQ / TEV_COUNT * (TICKSPERSEC / PID_FREQ),
		AUTOPILOT_FREQ, autopilotupdate);

	// initilize debug commands
	addcommand("r", rcmd);
	addcommand("info", infocmd);
	addcommand("flash", flashcmd);
	addcommand("system", systemcmd);
	addcommand("log", logcmd);
	addcommand("motor", motorcmd);
	addcommand("autopilot", autopilotcmd);
	addcommand("set", setcmd);
	addcommand("get", getcmd);
	addcommand("apply", applycmd);

	__HAL_TIM_SET_COUNTER(pconf_schedhtim, 0);

	Init = 1;

	// main control loop
	while (1) { }

	return 0;
}
